
# Указаны типы персонажей и их возможные параметры

types = {
    "warrior" : {                       # Тип - Воин
        "strength": 30,                 # Сила
        "agility": 10,                  # Ловкость
        "intellect": 5,                 # Интеллект
        "initiative": 0,                # Инициатива
        "health": 20,                   # Здоровье
        "energy": 5,                    # Энергия
        "persistence": 5,               # Стойкость
        "reaction": 3,                  # Реакция
        "consciousness": 0,             # Сознание
        "burden": 0,                    # Ноша
        "athletics": 0,                 # Навык - Атлетика
        "no_weapons": 25,               # Навык - Без оружия
        "endurance": 0,                 # Навык - Выносливость
        "throwing": 15,                 # Навык - Метание
        "heavy_weapon": 25,             # Навык - Тяжёлое оружие
        "cold_weapon": 25,              # Навык - Холодное оружие
        "gambl": 0,                     # Навык - Азартные игры
        "acrobatics": 5,                # Навык - Акробатика
        "theft": 0,                     # Навык - Воровство
        "light_weapon": 25,             # Навык - Лёгкое оружие
        "traps": 0,                     # Навык - Ловушки
        "observation": 0,               # Навык - Наблюдательность
        "hack": 0,                      # Навык - Взлом
        "hightech_weapons": 0,          # Навык - Высокотехнологичное оружие
        "engineering": 0,               # Навык - Инженерия
        "medicine": 0,                  # Навык - Медицина
        "negotiation": 5,               # Навык - Переговоры
        "trade": 0,                     # Навык - Торговля
    }
}
